In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
print(np.__version__)
print(pd.__version__)

1.26.4
2.2.2

# Pandas
## Table of Contents:
- Series
- DataFrame
- Create a Series from Dictionary Elements
- Create a DataFrame from a Dictionary of Lists
- Create a DataFrame from a List of Dictionaries
- Reading data from .csv (Excel) file
- Accessing Data from DataFrame
- Accessing a specific element
- Data manipulation with DataFrames
- Statistical Methods

## Series
- A Pandas Series is a one-dimensional, labeled array capable of holding data of any type (integers, floats, strings, etc.).
- One-dimensional labeled array.
- Can hold data of any type (integers, floats, strings, etc.).
- Consists of two main components: values and index.
- Each element is associated with a unique index label.
- Supports fast and efficient element access and slicing.
- More flexible than NumPy arrays due to labeled indexing.
- Often used to represent a single column in a DataFrame.
- Supports vectorized operations and alignment by index.
- Automatically handles missing data (e.g., NaN values).

## DataFrame
- Two-dimensional, size-mutable, and heterogeneous data structure.
- Consists of rows and columns, similar to a table or spreadsheet.
- Each column is a Pandas Series with its own data type and label.
- Labeled axes: row index (axis=0) and column labels (axis=1).
- Can hold different data types in different columns (e.g., int, float, string).
- Supports rich data manipulation: filtering, sorting, grouping, aggregation, etc.
- Offers built-in handling for missing data using NaN.
- Allows easy data import/export from formats like CSV, Excel, SQL, JSON, etc.
- Enables vectorized operations and broadcasting for high performance.
- Ideal for structured data analysis, cleaning, and transformation.

## Pandas Series

### Creating a Pandas Series

In [5]:
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series:\n",series) # Gives index along with the element
print(type(series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

### Create a Series from Dictionary Elements

In [63]:
data = {'a':1 , 'b':2, 'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [7]:
data = [10, 20, 30]
index = ['a','b','c']
pd.Series(data, index = index)

a    10
b    20
c    30
dtype: int64

## DataFrame

### Create a DataFrame from a dictionary of Lists

In [9]:
data = {
    'Name':['Krish','Shubh','Jack'],
    'Age':[42,23,25],
    'City':['Bangalore','Singapore','NYC']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   42  Bangalore
1  Shubh   23  Singapore
2   Jack   25        NYC
<class 'pandas.core.frame.DataFrame'>

### Convert the DataFrame into a NumPy array

In [10]:
np.array(df)

array([['Krish', 42, 'Bangalore'],
       ['Shubh', 23, 'Singapore'],
       ['Jack', 25, 'NYC']], dtype=object)

### Create a DataFrame from a List of Dictionaries

In [12]:
data = [
    {'Name':'Shubh','Age':23,'City':'Singapore'},
    {'Name':'Krish','Age':24,'City':'Singa'},
    {'Name':'Jack','Age':25,'City':'Sing'},
    {'Name':'John','Age':26,'City':'Sin'}
]
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Shubh   23  Singapore
1  Krish   24      Singa
2   Jack   25       Sing
3   John   26        Sin
<class 'pandas.core.frame.DataFrame'>

### Reading Data from a .csv (Excel) file
- The csv file is in the same folder as this (.ipynb file) Jupyter Notebook
- .head(x) = gets the first 'x' rows
- .tail(x) = gets the last 'x' rows

In [13]:
df = pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [14]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

### Accessing Data from DataFrame

In [15]:
df

          Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    NaN   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West
15  2023-01-16        C    NaN  Product1  895.0  North
16  2023-01-17        C   93.0  Product2  511.0  South
17  2023-01-18        C    NaN  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        A   59.0  Product1  736.0   East
20  2023-01-21        C   82.0  Product3  606.0  South
21  2023-01-22        C   37.0  Product2  992.0  South
22  2023-01-23        B   62.0  Product3  942.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
24  2023-01-25        A   24.0  Product2  458.0   East
25  2023-01-26        C   95.0  Product1  584.0   West
26  2023-01-27        C   71.0  Product2  619.0  North
27  2023-01-28        C   56.0  Product2  224.0  North
28  2023-01-29        B    NaN  Product3  617.0  North
29  2023-01-30        C   51.0  Product2  737.0  South
30  2023-01-31        B   50.0  Product3  735.0   West
31  2023-02-01        A   17.0  Product2  189.0   West
32  2023-02-02        B   63.0  Product3  338.0  South
33  2023-02-03        C   27.0  Product3    NaN   East
34  2023-02-04        C   70.0  Product3  669.0   West
35  2023-02-05        B   60.0  Product2    NaN   West
36  2023-02-06        C   36.0  Product3  177.0   East
37  2023-02-07        C    2.0  Product1    NaN  North
38  2023-02-08        C   94.0  Product1  408.0  South
39  2023-02-09        A   62.0  Product1  155.0   West
40  2023-02-10        B   15.0  Product1  578.0   East
41  2023-02-11        C   97.0  Product1  256.0   East
42  2023-02-12        A   93.0  Product3  164.0   West
43  2023-02-13        A   43.0  Product3  949.0   East
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [18]:
data = [
    {'Name':'Shubh','Age':23,'City':'Singapore'},
    {'Name':'Krish','Age':24,'City':'Bangalore'},
    {'Name':'Jack','Age':25,'City':'NYC'},
    {'Name':'John','Age':26,'City':'London'}
]
df = pd.DataFrame(data)
print(df)

    Name  Age       City
0  Shubh   23  Singapore
1  Krish   24  Bangalore
2   Jack   25        NYC
3   John   26     London

In [19]:
df

    Name  Age       City
0  Shubh   23  Singapore
1  Krish   24  Bangalore
2   Jack   25        NYC
3   John   26     London

### Fetches the entire column from the DataFrame
- Picking only 1 column from the DataFrame makes it a Series

In [22]:
df['Name']

0    Shubh
1    Krish
2     Jack
3     John
Name: Name, dtype: object

In [24]:
type(df['Name']) # Picking 1 column makes it a series

pandas.core.series.Series

### DataFrame Operations
- loc[x] : Row Index Operation
- iloc[x] : Column Index Operation
- loc[x][y] : Row and Column index to access element
- iloc[x][y] : # Row and Column index to access element

In [25]:
df.loc[0] # Row Index Operation

Name        Shubh
Age            23
City    Singapore
Name: 0, dtype: object

In [26]:
df.iloc[0] # Column Index Operation

Name        Shubh
Age            23
City    Singapore
Name: 0, dtype: object

In [27]:
df.loc[0][0] # Row and Column index to access element

C:\Users\shubh\AppData\Local\Temp\ipykernel_17304\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Shubh'

In [29]:
df.iloc[0][1] # Row and Column index to access element

C:\Users\shubh\AppData\Local\Temp\ipykernel_17304\2651318850.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1] # Row and Column index to access element

23

In [31]:
df.iloc[0][2] # Row and Column index to access element

C:\Users\shubh\AppData\Local\Temp\ipykernel_17304\2317265474.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2] # Row and Column index to access element

'Singapore'

### Accessing a specific element 
- using .at[ ]
- .at[Column-Index , Column-Name]

In [32]:
df

    Name  Age       City
0  Shubh   23  Singapore
1  Krish   24  Bangalore
2   Jack   25        NYC
3   John   26     London

In [33]:
df.at[1,'Age']

24

In [34]:
df.at[0,'Age']

23

In [35]:
df.at[0,'City']

'Singapore'

In [36]:
df.at[0,'Name']

'Shubh'

### Accessing a specific element 
- using .iat()
- User can give Row and Column Index

In [39]:
df

    Name  Age       City
0  Shubh   23  Singapore
1  Krish   24  Bangalore
2   Jack   25        NYC
3   John   26     London

In [38]:
df.iat[0,0]

'Shubh'

In [41]:
df.iat[0,2]

'Singapore'

In [42]:
df.iat[2,2]

'NYC'

### Data Manipulation with DataFrames
- Adding a Column
- Removing a Column
- By default, axis = 0, only checks for Rows, not Columns
- To get access to columns, axis = 1
- To make changes permanent (save state), inplace = True
- df[Column-Name] = df[Column-Name] + 1

In [43]:
df['Salary'] = [150000, 125000, 100000, 75000]
df

    Name  Age       City  Salary
0  Shubh   23  Singapore  150000
1  Krish   24  Bangalore  125000
2   Jack   25        NYC  100000
3   John   26     London   75000

In [44]:
# By default, axis = 0, only checks for Rows, not Columns
# This will throw an error if executed

df.drop('Salary', axis = 0)

KeyError: "['Salary'] not found in axis"

In [58]:
# To get access to columns, axis = 1

df.drop('City',axis = 1)

KeyError: "['City'] not found in axis"

In [46]:
# But it is not a permanent operation, the state of the DataFrame does not change

df

    Name  Age       City  Salary
0  Shubh   23  Singapore  150000
1  Krish   24  Bangalore  125000
2   Jack   25        NYC  100000
3   John   26     London   75000

In [47]:
# To save the changes, use inplace = True

df.drop('City',axis = 1, inplace = True)

In [48]:
df

    Name  Age  Salary
0  Shubh   23  150000
1  Krish   24  125000
2   Jack   25  100000
3   John   26   75000

In [49]:
df['Age'] = df['Age'] + 1
df

    Name  Age  Salary
0  Shubh   24  150000
1  Krish   25  125000
2   Jack   26  100000
3   John   27   75000

In [55]:
# Removes Row with index = 1
# Not a permanent operation

df.drop(1)

KeyError: '[1] not found in axis'

In [56]:
# Removes Row with index = 1
# Permanent operation

df.drop(1, inplace = True)

KeyError: '[1] not found in axis'

In [57]:
df

    Name  Age  Salary
0  Shubh   24  150000
2   Jack   26  100000
3   John   27   75000

In [59]:
df = pd.read_csv('data.csv')
df.head(3)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East

## Statistical Methods
- Data types of Elements in each column of csv file
- Statistical Summary

In [60]:
# Display the datatypes of each column
print("Data types:\n", df.dtypes)

Data types:
 Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [61]:
# Describe the DataFrame
print("Statistical Summary:\n", df.describe())

Statistical Summary:
            Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [62]:
# 25,50,75 percentiles
# Mean, Standard Deviation, Min, Max
# Count - Number of records

df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000